# CH.6 Data Loading Storage and File Formats

## 1. Text Format

In [42]:
import numpy as np
import pandas as pd
import sys
import csv
import json

In [2]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
pd.read_table('ex1.csv')  # read table

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [4]:
pd.read_csv('ex2.csv',header=None) # no column

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
pd.read_csv('ex2.csv',names=['a','b','c','d','message'])  # set column manually

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
names=['a','b','c','d','message']
pd.read_csv('ex2.csv',names=names,index_col='message')  # index_col

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
parsed = pd.read_csv('csv_mindex.csv')
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [8]:
parsed=pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [9]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [10]:
result=pd.read_table('ex3.txt',sep='\s+')  # \s+
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [11]:
pd.read_csv('ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [12]:
pd.read_csv('ex4.csv',skiprows=[0,2,3])  # skiprows

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
result=pd.read_csv('ex5.csv') 
result  # NaN

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [14]:
pd.isnull(result)  # isnull

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [15]:
result = pd.read_csv('ex5.csv',na_values=['foo'])  # na_values
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [16]:
sentinels={'message':['world','NA'],'something':['two']}
pd.read_csv('ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8     NaN
2     three  9  10  11.0  12     foo

In [17]:
pd.options.display.max_rows=10  # set maximum

In [18]:
result=pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [20]:
pd.read_csv('ex6.csv',nrows = 5)  # nrows

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [21]:
chunker = pd.read_csv('ex6.csv',chunksize=1000)  # chunksize
chunker

In [22]:
chunker=pd.read_csv('ex6.csv',chunksize=1000)  # count key row
tot=pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)
    
tot=tot.sort_values(ascending=False)
tot[:10]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [23]:
data=pd.read_csv('ex5.csv')  # to_csv
data.to_csv('out.csv')
pd.read_table('out.csv')

  ,something,a,b,c,d,message
0           0,one,1,2,3.0,4,
1         1,two,5,6,,8,world
2   2,three,9,10,11.0,12,foo

In [25]:
data.to_csv(sys.stdout,sep='|')  # another sep

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [26]:
data.to_csv(sys.stdout,na_rep="empty")

,something,a,b,c,d,message
0,one,1,2,3.0,4,empty
1,two,5,6,empty,8,world
2,three,9,10,11.0,12,foo

In [27]:
data.to_csv(sys.stdout,index=False,header=False)  # not include row, column index

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [28]:
data.to_csv(sys.stdout,index=False, columns=['a','b','c'])  # indexing

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [29]:
dates = pd.date_range('1/1/2000',periods=7)  # to _csv in series
ts = pd.Series(np.arange(7),index=dates)
ts.to_csv('tseries.csv')
pd.read_csv('tseries.csv')

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

In [31]:
f=open('ex7.csv')
reader=csv.reader(f)

In [32]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [33]:
with open('ex7.csv')as f:
    lines = list(csv.reader(f))
    
header,values=lines[0],lines[1:]

pd.read_csv('ex7.csv')

   a  b  c
0  1  2  3
1  1  2  3

In [34]:
data_dict = {h:v for h, v in zip(header, zip(*values))}  # zip(*values)
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

## 2. JSON data

In [35]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [36]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [37]:
asjson = json.dumps(result)  # json.dumps
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [38]:
siblings = pd.DataFrame(result['siblings'],columns=['name','age'])  # select data field
siblings

    name  age
0  Scott   30
1  Katie   38

In [39]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [40]:
print(data.to_json())  # save

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [41]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## 3. XML and HTML

In [43]:
pip install lxml

Requirement already satisfied: lxml in c:\programdata\anaconda3\lib\site-packages (4.5.0)
Note: you may need to restart the kernel to use updated packages.

In [44]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in c:\programdata\anaconda3\lib\site-packages (4.8.2)
Requirement already satisfied: html5lib in c:\programdata\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: soupsieve>=1.2 in c:\programdata\anaconda3\lib\site-packages (from beautifulsoup4) (1.9.5)
Requirement already satisfied: six>=1.9 in c:\programdata\anaconda3\lib\site-packages (from html5lib) (1.14.0)
Requirement already satisfied: webencodings in c:\programdata\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [45]:
tables = pd.read_html('fdic_failed_bank_list.html')
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [47]:
failures=tables[0]
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [48]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [49]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [50]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [51]:
from lxml import objectify

path = 'mta_perf/Performance_MNR.xml'
parsed=objectify.parse(open(path))
root=parsed.getroot()

In [52]:
# dictionary list
data = []

skip_fields = ['PARENT_SEQ','INDICATOR_SEQ',
            'DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag]=child.pyval
    data.append(el_data)

In [54]:
# transform to dataframe
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [55]:
from io import StringIO
tag='<a href="http://www.google.com">Google</a>'
root=objectify.parse(StringIO(tag)).getroot()

In [56]:
print(root)
print(root.get('href'))
print(root.text)

Google
http://www.google.com
Google

## 4. Binary Data Formats - Pickle

In [57]:
frame=pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [58]:
frame.to_pickle('frame_pickle')

In [59]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [60]:
frame = pd.DataFrame({'a':np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [61]:
store['obj1']

           a
0   0.040424
1   2.042253
2   2.024886
3   0.735979
4   0.566843
..       ...
95  0.128626
96  0.127417
97  1.430871
98 -1.166484
99 -1.532906

[100 rows x 1 columns]

In [62]:
store.put('obj2',frame,format = 'table')
store.select('obj2',where=['index>=10 and index<=15'])  # indexing

           a
10  0.718313
11 -0.986630
12 -1.172677
13 -0.305995
14  0.924263
15 -0.680816

In [63]:
store.close()

In [64]:
frame.to_hdf('mydata.h5','obj3',format = 'table')  # HDF5 Format

In [65]:
pd.read_hdf('mydata.h5','obj3',where = ['index<5'])

          a
0  0.040424
1  2.042253
2  2.024886
3  0.735979
4  0.566843

## 5. Microsoft Excel Files

In [66]:
xlsx=pd.ExcelFile('ex1.xlsx')
xlsx

In [67]:
pd.read_excel(xlsx,"Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [68]:
frame=pd.read_excel('ex1.xlsx','Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [69]:
writer=pd.ExcelWriter('ex2.xlsx')
frame.to_excel(writer,'Sheet1')
writer.save()

In [70]:
frame.to_excel('ex2.xlsx')

## 6. Web APIs

In [71]:
import requests
url='https://api.github.com/repos/pandas-dev/pandas/issues'
resp=requests.get(url)
resp

In [72]:
data = resp.json()

In [73]:
data[0]['title']

'QST: Python 3.9 testing in CI'

In [74]:
issues = pd.DataFrame(data,columns=['number','title','labels','state'])
issues

,number,title,labels,state
0,36279,QST: Python 3.9 testing in CI,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
1,36278,[TST]: Add test for 24768,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
2,36277,ENH: add peek function,"[{'id': 219960758, 'node_id': 'MDU6TGFiZWwyMTk...",open
3,36276,CLN: typo cleanups,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
4,36275,Fix #35484 - re-allow sqlalchemy declarative s...,[],open
...,...,...,...,...
25,36250,CLN: simplify Categorical comparisons,[],open
26,36249,BUG: na parameter for str.startswith and str.e...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,36248,BUG:Inconsistent when use Series.get,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
28,36245,BUG: pd.json_normalize on a column loses rows ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,36241,"BUG: .str.startswith(..., na=False) consistenc...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open